app/controllers/greetings_controller.rb

  def index
    @greetings = Greeting.all.order(created_at: :desc)  #mostrara en orden, controlo como mostrar la info por medio de metodos puedo poner :asc
---
SELECT "greetings".* FROM "greetings" ORDER BY "greetings"."created_at" DESC

  def create
    #binding.pry
    @greeting = Greeting.new(greeting_params) #solo los atributos necesario que el navegador envia al server por ende la db
    respond_to do |format|
      if @greeting.save
---
INSERT INTO "greetings" ("name", "message", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "walter"], ["message", "Hi everyone!"], ["created_at", "2021-08-31 19:20:14.355954"], ["updated_at", "2021-08-31 19:20:14.355954"]]

    def set_greeting  # codigo para que set_greeting recupere una instancia de Greeting basada en el ID presente en params (los parametros de la petición)
      @greeting = Greeting.find(params[:id])
---
SELECT "greetings".* FROM "greetings" WHERE "greetings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]